Project/Toir/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИерархическиеСтруктурыОР</name>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/CommonModules/торо_ОтчетыСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает запросы для наборов данных Иерархия и Контроль 
// в отчетах с иерархией по объектам ремонта.
//
// Параметры:
//		СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - схема компоновки данных.
//		ТекИерархия - СправочникСсылка.торо_СтруктурыОР - выбранная иерархия.
//		ИмяПараметраДатаСреза - Строка - название параметра для среза по иерархиии, изменяемой документами.
//		ИмяОсновногоНабораДанных - Строка - имя набора данных с основной информацией для отчета.
//
Процедура УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, ИмяПараметраДатаСреза = "ДатаОкончания", ИмяОсновногоНабораДанных = "Объекты") Экспорт

	Если ТекИерархия.СтроитсяАвтоматически Тогда

		Если Метаданные.Справочники[ТекИерархия.ТипРеквизитаОР].Иерархический Тогда
			
			СхемаКомпоновкиДанных.НаборыДанных.Иерархия.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ОбъектИерархии,
			|	СправочникСсылка.Родитель КАК РодительИерархии
			|ИЗ
			|	Справочник." + ТекИерархия.ТипРеквизитаОР + " КАК СправочникСсылка
			|ГДЕ
			|	СправочникСсылка.Ссылка В (&Элемент)";
			
			СхемаКомпоновкиДанных.НаборыДанных.Контроль.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ЭлементКонтроль,
			|	СправочникСсылка.Родитель КАК РодительКонтроль
			|ИЗ
			|	Справочник." + ТекИерархия.ТипРеквизитаОР + " КАК СправочникСсылка
			|ГДЕ
			|	СправочникСсылка.Родитель В(&Родитель)";
			
		Иначе
			
			СхемаКомпоновкиДанных.НаборыДанных.Иерархия.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ОбъектИерархии,
			|	Значение(Справочник." + ТекИерархия.ТипРеквизитаОР + ".ПустаяСсылка) КАК РодительИерархии
			|ИЗ
			|	Справочник." + ТекИерархия.ТипРеквизитаОР + " КАК СправочникСсылка"; 
			
			СхемаКомпоновкиДанных.НаборыДанных.Контроль.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СправочникСсылка.Ссылка КАК ЭлементКонтроль,
			|	Значение(Справочник." + ТекИерархия.ТипРеквизитаОР + ".ПустаяСсылка) КАК РодительКонтроль
			|ИЗ
			|	Справочник." + ТекИерархия.ТипРеквизитаОР + " КАК СправочникСсылка"; 
						
		КонецЕсли;
		
		ПолеИерархия = СхемаКомпоновкиДанных.НаборыДанных[ИмяОсновногоНабораДанных].Поля.Найти("ОбъектИерархии");
		Если ПолеИерархия <> Неопределено Тогда
			ПолеИерархия.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка."+ТекИерархия.ТипРеквизитаОР);
		КонецЕсли;

	Иначе

		Если ТекИерархия.ИзменяетсяДокументами Тогда
			
			СхемаКомпоновкиДанных.НаборыДанных.Иерархия.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Документами.ОбъектИерархии КАК ОбъектИерархии,
			|	Документами.РодительИерархии КАК РодительИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(&"+ИмяПараметраДатаСреза+"{&"+ИмяПараметраДатаСреза+"}, СтруктураИерархии = &ИерархияТип) КАК Документами
			|ГДЕ
			|	Документами.ОбъектИерархии В(&Элемент)
			|	И НЕ Документами.Удален";
			
			СхемаКомпоновкиДанных.НаборыДанных.Контроль.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Документами.ОбъектИерархии КАК ЭлементКонтроль,
			|	Документами.РодительИерархии КАК РодительКонтроль
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(&"+ИмяПараметраДатаСреза+"{&"+ИмяПараметраДатаСреза+"}, СтруктураИерархии = &ИерархияТип) КАК Документами
			|ГДЕ
			|	Документами.РодительИерархии В(&Родитель)
			|	И НЕ Документами.Удален";
			
		Иначе
			
			СхемаКомпоновкиДанных.НаборыДанных.Иерархия.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БезДокументов.ОбъектИерархии КАК ОбъектИерархии,
			|	БезДокументов.РодительИерархии КАК РодительИерархии
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК БезДокументов
			|ГДЕ
			|	БезДокументов.СтруктураИерархии = &ИерархияТип
			|	И БезДокументов.ОбъектИерархии В(&Элемент)";
			
			СхемаКомпоновкиДанных.НаборыДанных.Контроль.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БезДокументов.ОбъектИерархии КАК ЭлементКонтроль,
			|	БезДокументов.РодительИерархии КАК РодительКонтроль
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК БезДокументов
			|ГДЕ
			|	БезДокументов.СтруктураИерархии = &ИерархияТип
			|	И БезДокументов.РодительИерархии В(&Родитель)";
				
		КонецЕсли;
		
		ПолеИерархия = СхемаКомпоновкиДанных.НаборыДанных[ИмяОсновногоНабораДанных].Поля.Найти("ОбъектИерархии");
		Если ПолеИерархия <> Неопределено Тогда
			ПолеИерархия.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта");
		КонецЕсли;

	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработатьТабличныйДокументПослеФормированияОтчета(ИмяФормы, ОтчетТабличныйДокумент) Экспорт
	
	Если ИмяФормы = "Отчет.торо_ПланФактныйАнализППР.Форма" Тогда
		ЯчейкаСЗаголовком = ОтчетТабличныйДокумент.НайтиТекст("План-фактный анализ ППР");
		Если ЯчейкаСЗаголовком <> Неопределено Тогда
			ОбластьНачалоПоиска = ОтчетТабличныйДокумент.Область(0, 0, ЯчейкаСЗаголовком.Низ, 0);
			ВтораяЯчейкаСЗаголовком = ОтчетТабличныйДокумент.НайтиТекст("План-фактный анализ ППР", ОбластьНачалоПоиска);
			Если ВтораяЯчейкаСЗаголовком <> Неопределено Тогда
				ОбластьДоШапки = ОтчетТабличныйДокумент.Область(0, 0, ВтораяЯчейкаСЗаголовком.Низ, 0); 
				ОбластьДоШапки.Сгруппировать("ШапкаОтчета");
			Иначе
				ОбластьДоШапки = ОтчетТабличныйДокумент.Область(0, 0, ЯчейкаСЗаголовком.Низ, 0); 
				ОбластьДоШапки.Сгруппировать("ШапкаОтчета");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
